(() => {
  "use strict";
  const questions = [
    {
      text: "江云雁2020年跃迁时的工服是什么颜色？",
      options: ["白色", "黑色", "绿色", "都不对"],
      answer: "绿色"
    },
    {
      text: "何愉辉二人第一次在江云雁餐厅点的什么食物？",
      options: ["卤肉面", "肉酱披萨", "兰州拉面", "都不对"],
      answer: "肉酱披萨"
    },
    {
      text: "江云雁的笔记本电脑是什么品牌？",
      options: ["微软", "华为", "小米", "都不对"],
      answer: "都不对"
    },
    {
      text: "江云雁喜欢的歌手？",
      options: ["邓紫棋", "苏打绿", "周杰伦", "Queen"],
      answer: "周杰伦"
    }
  ];

  const memoLines = [
    "“每天盯着这张照片一个小时，男人美名曰其为‘跨越维度的心灵交流’”",
    "“考试的时候怎么没见你直觉准过？”\n\n“骗人死老冯”",
    "“这饮料都是刚端上来的我不会下毒的我的老天...”\n\n“噗-”",
    "“怎样啊，你要牵我手啊”\n\n“滚...滚啊，给我点纸擦手嘛...”",
    "“你今天好奇怪哦”\n\n“有吗”",
    "“假如你是叶湘伦，你会回到琴房弹奏《Secret》吗？”\n\n当然",
    "“他说我又不会去世，日子长着呢”\n\n“我为什么不早点开始写日记呢？”",
    "“他说，苦的东西好像喝不腻”\n\n“我尝了一杯，刚开始挺苦的，慢慢也习惯了”",
    "“干嘛干嘛...”\n\n“先擦擦嘴啊，亲的我满脸都是油...”",
    "“所以你看。”\n\n“我这人挺熟练的，对于接受这种事...”",
    "“明天...就在家吧。”\n\n“我想多看看你...”",
    "“就这样看着他，安安静静的，真好...”\n\n“他应该快醒了，就写到这吧。”",
    "“你是个天才！孩子，你的运算完全正确！”\n\n“操！！！”",
    "“你是不是要走”\n\n“嗯”\n\n“他妈的高深呢！”\n\n“他没有错”",
    "“你...是不是...放东西了...”\n\n“睡吧。”",
    "“你可以叫我一声...宝贝吗？”\n\n“...宝贝。”",
    "“这家热干面...她很喜欢吃。”\n\n“操你妈！”",
    "“现在是几几年？”\n\n“你板住头了学生？”",
    "“oi.”\n\n“哪天我要是猝死在这里了，记得帮我清理浏览记录。”\n\n“高深，你...哈哈，你长白头发了！”\n\n“小子，你比我多两根！”",
    "“过得好快啊...”\n\n“是啊，好快啊...”",
    "“祝你好运，我的兄弟。”\n\n“咚！！！！！”",
    "“文字...时间之河...”\n\n“传给...想看的人！！！”",
    "“是他！”\n\n“真的是他！”",
    "“走吧...”\n\n“我们去香山。”",
    "“那女孩最后回来了吗？”\n\n“你猜呀”"
  ];


  window.FHJJ_STORY = { questions, memoLines };
})();

